# SectionArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..SectionArea Property
StructuralSectionAnalysisParams Class See Also
---
Cross section area.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double SectionArea { get; set; }
```

Visual Basic
---
```text
Public Property SectionArea As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SectionArea {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace